In [1]:
import pandas as pd
import seaborn as sns

In [7]:
df = pd.read_csv(r"C:\Users\sathw\Downloads\groupbyExcercise - groupbyExcercise.csv")
df

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  2023-01-01       A      221         3
1            1  2023-01-01       B      111         8
2            2  2023-01-02       B      171        11
3            3  2023-01-02       A      141        15
4            4  2023-02-01       A       75         4
5            5  2023-02-01       B       90        12
6            6  2023-02-02       A       96        17
7            7  2023-02-02       B      170        10
8            8  2023-03-01       B      200        19
9            9  2023-03-01       A      120        10
10          10  2023-03-02       A      121        12
11          11  2023-03-02       B      150         5

In [35]:
G=df.groupby([df.index.year.values,df.index.month.values]).sum()
G

AttributeError: 'RangeIndex' object has no attribute 'year'

#### a)Arrange DataFrame df, focusing on distinct product categories. Explore the data to reveal:
* i) Overall revenue insights
* ii) Average revenue patterns
* iii) Peak quantity sold observations
* iv) Minimum quantity sold occurrences

In [8]:
# removed unnamed column
df.drop(columns = ['Unnamed: 0'],inplace = True)
df

          Date Product  Revenue  Quantity
0   2023-01-01       A      221         3
1   2023-01-01       B      111         8
2   2023-01-02       B      171        11
3   2023-01-02       A      141        15
4   2023-02-01       A       75         4
5   2023-02-01       B       90        12
6   2023-02-02       A       96        17
7   2023-02-02       B      170        10
8   2023-03-01       B      200        19
9   2023-03-01       A      120        10
10  2023-03-02       A      121        12
11  2023-03-02       B      150         5

#### i) Overall revenue insights

In [14]:
s = df.groupby(['Product'])['Revenue'].sum()
s

Product
A    774
B    892
Name: Revenue, dtype: int64

#### ii) Average revenue patterns

In [21]:
df.groupby(['Product'])['Revenue'].mean()

Product
A    129.000000
B    148.666667
Name: Revenue, dtype: float64

#### iii)Peak quantity sold observations

In [24]:
df.groupby(['Product'])['Quantity'].max()

Product
A    17
B    19
Name: Quantity, dtype: int64

#### iv) Minimum quantity sold occurrences

In [25]:
df.groupby(['Product'])['Quantity'].min()

Product
A    3
B    5
Name: Quantity, dtype: int64

#### 2) Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [38]:
df['Date'] = pd.to_datetime(df['Date'])
df['Month'] = df['Date'].dt.month
df['Year'] = df['Date'].dt.year
df[['Date','Month','Year']]

         Date  Month  Year
0  2023-01-01      1  2023
1  2023-01-01      1  2023
2  2023-01-02      1  2023
3  2023-01-02      1  2023
4  2023-02-01      2  2023
5  2023-02-01      2  2023
6  2023-02-02      2  2023
7  2023-02-02      2  2023
8  2023-03-01      3  2023
9  2023-03-01      3  2023
10 2023-03-02      3  2023
11 2023-03-02      3  2023

In [39]:
df.groupby(['Year', 'Month'])['Revenue'].sum()

Year  Month
2023  1        644
      2        431
      3        591
Name: Revenue, dtype: int64

#### 3) Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [52]:
a = df.groupby(['Date'])[['Revenue', 'Quantity']].sum()
a

            Revenue  Quantity
Date
2023-01-01      332        11
2023-01-02      312        26
2023-02-01      165        16
2023-02-02      266        27
2023-03-01      320        29
2023-03-02      271        17

In [54]:
# highest revenue sold # highest quantity sold
b = a.idxmax()
print(b)

Revenue    2023-01-01
Quantity   2023-03-01
dtype: datetime64[ns]

#### 4)  Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15

In [55]:
a = df.groupby(['Date','Product'])['Quantity'].sum()
b = a[(a > 10) & (a < 15)]
b

Date        Product
2023-01-02  B          11
2023-02-01  B          12
2023-03-02  A          12
Name: Quantity, dtype: int64